doggo/app/controllers/answers_controller.rb

SELECT  "answers".* FROM "answers" WHERE "answers"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @answer = Answer.find(params[:id])

SELECT  "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
INSERT INTO "answers" ("value", "question_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["value", true], ["question_id", 8], ["created_at", "2018-06-25 19:29:02.833611"], ["updated_at", "2018-06-25 19:29:02.833611"]]
---
  def create
    @answer = Answer.new(answer_params)
    @question = Question.find(params[:question_id])
    if @answer.save