doggo/app/controllers/options_controller.rb

    def create
        @option = Option.new(options_params)
        if @option.save
---
INSERT INTO "options" ("question_id", "o_content", "o_color", "created_at", "updated_at", "avail_points") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["question_id", 1], ["o_content", "status?"], ["o_color", "red"], ["created_at", "2018-07-02 13:28:51.348584"], ["updated_at", "2018-07-02 13:28:51.348584"], ["avail_points", 10]]