doggo/app/controllers/questions_controller.rb

INSERT INTO "questions" ("content", "created_at", "updated_at", "survey_id", "source") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["content", "How are you feeling?"], ["created_at", "2018-07-02 12:29:51.129971"], ["updated_at", "2018-07-02 12:29:51.129971"], ["survey_id", 1], ["source", "Rescue"]]
---
  def create
    @question = Question.new(question_params)
    if @question.save