doggo/app/controllers/results_controller.rb

SELECT "results".* FROM "results"
---
  def index
    @results = Result.all

SELECT  "results".* FROM "results" WHERE "results"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @result = Result.find(params[:id])

INSERT INTO "results" ("created_at", "updated_at", "color", "survey_id", "initial_score", "final_score") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["created_at", "2018-06-27 19:45:15.126219"], ["updated_at", "2018-06-27 19:45:15.126219"], ["color", "yellow"], ["survey_id", 1], ["initial_score", 50], ["final_score", 100]]
---
  def create
    @result = Result.new(result_params)
    if @result.save

SELECT  "results".* FROM "results" WHERE "results"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "results" SET "color" = $1, "updated_at" = $2 WHERE "results"."id" = $3  [["color", "purple"], ["updated_at", "2018-06-29 20:24:53.458376"], ["id", 1]]
---
  def update
    @result = Result.find(params[:id])
    if @result.update(result_params)