doggo/app/controllers/results_controller.rb

  def show
    @result = Result.find(params[:id])
    @user = User.find(@result.user_id)
---
SELECT "results".* FROM "results" WHERE "results"."user_id" = $1  [["user_id", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]