doggo/app/controllers/surveys_controller.rb

  def index
    @surveys = Survey.all
---
SELECT "surveys".* FROM "surveys"

  def show
    @survey = Survey.find(params[:id])
---
SELECT  "surveys".* FROM "surveys" WHERE "surveys"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]