doggo/app/controllers/users_controller.rb

SELECT "users".* FROM "users"
---
    def index
        @users = User.all
        render json: @users.map{ |u| u.to_json }, status: 200

INSERT INTO "users" ("username", "password_digest", "created_at", "updated_at", "api_token") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
    def create
        @user = User.new(user_params)
        if @user.save